export default {
	guide: {
        welcome: ' ยินดีต้อนรับมาถึงTrue',
        importWallet: ' นำเข้ากระเป๋าเงิน',
        createWallet: ' สร้างกระเป๋าเงิน',
        importInstructions: ' ในกระเป๋าเงินที่ตั้งไว้ส่งออกคำที่ช่วยจำง่าย กด"นำเข้ากระเป๋าเงิน"อินพุตคำช่วยจำง่ายที่ส่งออกมา หลังนำเข้ากระเป๋าเงินต้องรีบทำคำช่วยจำสำรองไว้',
        createInstructions: ' ไม่มีกระเป๋าเงิน โปรดกด"สร้างกระเป๋าเงิน"เมื่อสร้าง กระเป๋าเงิน โปรดจำแน่นรหัสที่ตั้งไว้ หลังสร้างกระเป๋าเงินเสร็จให้รีบทำคำช่วยจำง่ายสำรอง  '
	},
	wallet: {
        mnemonic: ' คำช่วยจำง่าย',
        mnemonicPlaceholder: ' คำช่วยจำง่าย กดเสปซบาร์แยกตัว',
        officialWallet: ' กระเป๋าเงินทางการ',
        privateKey: ' คีย์ส่วนตัว',
        path: ' เส้นทาง',
        enterPwd: ' อินพุตรหัสของคุณ',
        confirmPwd: ' ยืนยันรหัสของคุณ',
        creatWallet: ' สร้างกระเป๋าเงิน',
        createWalletTip: ' โปรดอินพุตชื่อกระเป๋าเงิน',
        pwdSuggest: ' เสนอใช้อักขระไม่น้อยกว่า8ตัว',
        pwdIsWrong: ' รหัสสองครั้งต่างกัน',
        agreeTerm: ' โปรดอนุญาตข้อสัญญาที่ให้บริการและส่วนตัว',
        createWalletTipOfPwd: 'รหัสที่ใช้สำหรับคีย์ส่วนตัวที่ต้องตั้งรหัส ความแข็งแรงสำคัญมาก',
        createWalletTipOfNoStore: '！กระเป๋าเงินTrueไม่เก็บรหัสไว้ให้ แล้วหารหัสที่หายกลับมาไม่ได้ โปรดให้จแน่นรหัสตัวเอง',
        iAgreeTerm: ' ฉันอ่านรายละเอียดไปแล้วอนุญาตด้วย',
        term: ' ข้อสัญญาที่ให้บริการและส่วนตัว',
        mnemonicTip: ' คำช่วยจำง่ายบรรทัดที่ริเริ่มและที่สุดท้ายห้ามมีเสปซบาร์ โปรดอินพุตใหม่',
        mnemonicIsWrong: ' คำช่วยจำง่ายผิด โปรดอินพุตใหม่',
        mnemonicIsNull: ' คำช่วยจำง่ายจะว่างเปล่าไม่ได้',
        privateKeyIsNull: ' กุญแจส่วนตัวจะว่างเปล่าไม่ได้',
        privateKeyIsWrong: ' กุญแจส่วนตัวผิด โปรดอินพุตใหม่',
        keystoreIsNull: ' โปรดอินพุตข้อความkeystore',
        wrongByKeystoreOrPwd: ' นำเข้ากระเป๋าเงินไม่สำเร็จ โปรดเช็คดูkeystoreหรือรหัสถูกต้องหรือไม่',
        copyKeystoreTip:'คัดลอกและวางแปะข้อความไฟล์ที่กระเป๋าเงินkeystore Ethereum แบบทางการถึงช่องพิมพ์ข้อความ'
	},
	tab: {
        assets: 'สินทรัพย์ ',
        node: 'โหนด ',
        my: 'ของฉัน'
	},
	my: {
		home: {
            walletManagement: 'การจัดการกระเป๋าเงิน ',
            transactionRecord: 'บันทึกรายการซื้อขาย ',
            lockAccount: {
                _title: 'บัญชีล็อคคลัง ',
                _address: 'ที่อยู่ญชีล็อคคลัง ',
                minerFee: 'ค่าใช้จ่ายของคนงานเหมือง ',
                _title1: 'การบริหารบัญชี ',
                loginIn: 'เข้าสู่ระบบ ',
                quantity: 'จำนวนญชีล็อคคลัง ',
                country_region: 'ประเทศ / ภูมิภาค ',
                prompt: 'หมายเลขโทรศัพท์มือถือที่ไม่ได้ลงทะเบียนจะสร้างบัญชีโดยอัตโนมัติ ',
                accountNumber: 'บัญชี',
                logOut: 'ออกจากบัญชี'
            },
            systemSetting: 'การตั้งค่าระบบ',
			Versions: {
                _title: 'รุ่นล็อก'
			},
			helpCenter: {
                _title: 'ศูนย์ช่วยเหลือ',
                Mnemonic: 'คำช่วยจำง่ายคืออะไร',
                Keystore: 'keystore คืออะไร',
                privateKey: 'คีย์ส่วนตัวคืออะไร'
			},
			aboutUs: {
                _title: 'เกี่ยวกับเรา',
                currentVersion: 'รุ่นปัจจุบัน',
                introduction: "True เป็นSPVแอปพลิเคชันของMobile end ซึ่งออกแบบมาเพื่อมอบแอ็กเซสกระเป๋าเงินดิจิทัลที่ปลอดภัยและใช้งานง่ายและมีประสิทธิภาพสำหรับผู้ใช้ทั่วไป ",
                useAgreement: 'ข้อตกลงผู้ใช้',
                privacyPolicy: 'ข้อสัญญาส่วนตัว',
                versionLog: 'รุ่นล็อก',
                checkVersion: 'ตรวจสอบรุ่นใหม่'
			}
		},
		sysSetting: {
            _title: 'การตั้งค่าระบบ',
			language: {
                _title: 'การตั้งค่าภาษา',
                multi_language: 'ภาษาหลายชนิด ',
                changeToChinese: 'ภาษาจีนตัวย่อ ',
                changeToEnglish: 'English'
			}
		},
		version: {
            _newVersion: 'พบเห็นTrue',
            _version: 'รุ่น',
            upgradeNow: ' อัปเกรดทันที',
            noEscalation: 'ยังไม่ต้องอัปเกรด ',
            noUpdate: 'รุ่นปัจจุบันเป็นรุ่นล่าสุดไม่จำเป็นต้องอัปเกรด'
        },
        webHost: 'Web3 ตั้งค่า'

	},
	assets: {
        totalAssets: 'สินทรัพย์รวมของบัญชี',
		walletInfo: {
            title: 'ข้อมูลบัญชี',
            walletName: 'ชื่อกระเป๋าเงิน ',
            enterWalletName: 'ป้อนชื่อกระเป๋าเงิน',
            exportPrivateKey: 'ส่งออกคีย์ส่วนตัว',
            exportKeystore: 'ส่งออกkeystore',
            exportMnemonic: 'ส่งออกคำช่วยจำง่าย',
            deleteWallet: 'ลบกระเป๋าเงิน',
            eystoreFile: 'ไฟล์keystore ',
            qrcode: 'QR code',
            privateKeyWarning: 'คำเตือนด้านความปลอดภัย: คีย์ส่วนตัวไม่ได้ตั้งรหัสไว้ การส่งออกจะมีความเสี่ยง ขอแนะนำให้ใช้mnemonicและkeystore สำหรับการสำรองข้อมูล',
            copyPrivaateKey: 'คัดลอกคีย์ส่วนตัว',
            copyKeystore: 'คัดลอกkeystore',
            keystore_save: 'บันทึกแบบออฟไลน์',
            keystore_save_item: 'โปรดคัดลอกแปะไฟส์keystoreไปเก็บไว้ที่ปลอดภัยและที่นอกสาย อย่าเก็บในอุปกรณ์การสื่อสารอย่างเช่นอิ-เมลล์ สมุด สมุดบันทึก เครือข่ายดิสก์เป็นต้นเลย อันตรายมาก',
            keystore_network: 'โปรดอย่าส่งทางเน็ตเลย',
            keystore_network_item: 'โปรดอย่าส่งไฟส์keystoreทางเน็ตเลย，เมื่อถูกแฮกเกอร์ทำร้ายจะทำให้สินทรัพย์สูญหายไม่สามารถแก้ไขได้  โปรดใช้อุปกรณ์ออฟไลน์ส่งผ่าน QR code',
            Keystore_pwdsave: 'รหัสผ่านเก็บที่ตู้เซฟ',
            Keystore_pwdsave_item: 'ถ้าต้องการบันทึกแบบออนไลน์ขอแนะนำให้บันทึก keystore ด้วยซอฟต์แวร์จัดเก็บรหัสผ่านเช่น 1Password ที่มีระดับความปลอดภัยสูงกว่า ',
            keystore_scanning: 'ใช้สำหรับการสแกนแบบตรงเท่านั้น',
            keystore_scanning_item: 'ห้ามใช้รหัส QR code เพื่อบันทึกเก็บภาพหน้าจอและถ่ายรูป ใช้ผู้ใช้สามารถสแกนโดยตรงในสภาพแวดล้อมที่ปลอดภัยเพื่อนำเข้ากระเป๋าสตางค์ได้อย่างง่ายดาย ',
            keystore_surround: 'ใช้ในสภาพแวดล้อมที่ปลอดภัย',
            keystore_surround_item: 'กรุณาใช้ที่ไม่มีใครอยู่รอบตัวและไม่มีกล้องถ่ายรูป เมื่อรหัส QR ถูกผู้อื่นรู้จะทำให้เกิดการสูญเสียทรัพย์สินที่ไม่อาจแก้ไขได้ '
        },
		mnemonic: {
            backUpMnemonic: 'กรุณาทำสำรองข้อมูลคำช่วยจำง่ายของคุณ',
            mnemonicSuccess: 'ให้จำคำช่วยจำง่ายถูกต้อง โปรดเก็บคำช่วยจำง่ายของคุณไว้อย่างถูกต้อง ',
            mnemonicError: 'คำช่วยจำง่ายไม่ถูกต้อง โปรดป้อนใหม่',
            copyYourMnemonic: 'จดเขียนคำช่วยจำง่ายของคุณ',
            confirmMnemonic:' ยืนยันคำช่วยจำง่ายกระเป๋าสตางค์ของคุณ',
            mnemonicWring: 'คำช่วยจำง่ายจะใช้ในการเรียกคืนกระเป๋าสตางค์หรือรีเซ็ตรหัสผ่านของกระเป๋าสตางค์ จดเขียนไปยังกระดาษได้อย่างถูกต้องและเก็บไว้ในที่ที่ปลอดภัยเท่านั้นที่คุณรู้เอง ',
            confirmMnemonicWring: 'กรุณาคลิกที่ปุ่ม mnemonic เพื่อยืนยันว่าการสำรองข้อมูลคุณถูกต้อง '
		},
		currency: {
            transfer: 'โอนบัญชี',
            orderInformation: 'ข้อมูลออร์เดอร',
            recentTradeRecord: 'การบันทึกรายการช่วงนี้',
            receipt: 'เก็บรับเงิน',
            receiptAddr: 'ที่อยู่กระเป๋าสตางค์ผู้รับเงิน',
            transferCount: 'จำนวนโอนเงิน',
            transferRemarks: 'หมายเหตุ',
            transferFee: 'ค่าจ้างคนงานเหมือง',
            transferSpeedSlow: 'ช้า',
            transferSpeedFast: 'เร็ว',
            nextStep: 'ขั้นตอนต่อไป',
            copyReceiptAddr: 'คัดลอกที่อยู่เก็บรับเงิน'
		},
		transfer: {
            checkAddress: 'ที่อยู่ไร้สาระ กรุณาตรวจสอบอย่างละเอียด ',
            transferInAddress: 'ที่อยู่ที่โอนเข้า ',
            transferOutAddress: 'ที่อยู่ที่โอนออก'
		}
	},
	node: {
        signUp: 'ลงชื่อสมัครเพื่อเลือกตั้ง',
        vote: ' โหวต',
        voteInfo: {
            _baseInfo: 'ข้อมูลพื้นฐาน',
            _available: 'คะแนนเสียงที่มีผล：',
            enterNumber_votes: 'ป้อนจำนวนโหวต',
            confirmVote: 'ยืนยันการลงคะแนน',
            voteFail: 'การโหวตล้มเหลวโปรดลองอีกครั้งในภายหลัง ',
            voteSuccess: 'การลงทะเบียนการทำรายการเสร็จสิ้นการลงทะเบียน',
            voteApplyed: 'ประกาศการลงคะแนนเสียง',
            voteApplyedSuccess: 'การลงทะเบียนการทำรายการเสร็จสิ้นการลงทะเบียน'
		},
		fullNode: {
            fullNode_title: ' โหนดเต็ม'
        },
        fullNodeRank: 'การจัดอันดับโหนดเต็ม',
		standNode: {
            standNode_title: 'โหนดมาตรฐาน'
        },
        standNodeRank: 'การจัดอันดับโหนดมาตรฐาน',
		signUp_item: {
            fullNode: 'โหนดแบบเต็ม  (โหนด POW + PBFT)',
			fullNode_info:
                'โหนดแบบเต็ม (โหนดPOW + PBFT)  หรือที่เรียกว่า MasterNode:  สภาพโหนดเต็มที่ยังไม่ได้เข้าสู่คณะกรรมการ PBFT Committee  จะดำเนินภารกิจโหนด POW โดยอัตโนมัติ  โหนดทั้งหมดจำเป็นต้องมีข้อกำหนดเกี่ยวกับการใช้พลังงานคอมพิวเตอร์ที่สอดคล้องกัน  การแข่งขันส่วนบุคคลต้องมีไม่น้อยกว่า 50,000 TRUE  และดำเนินการล็อคคลังบัญชีด้วย   การเลือกตั้งทีมต้องมีจำนวนไม่น้อยกว่า 100,000 TRUE และดำเนินการกับระบบล็อคคลังบัญชีด้วย',
                standNode: 'โหนดมาตรฐาน (โหนด(POW)',
                standNode_info: 'โหนดมาตรฐานคือโหนด POW หลังจากระยะเวลาการทดสอบของเครือข่ายหลักจะไม่มีจำนวนโหนดจำกัด แล้วจะมีการดำเนินงานโหนดPOWเท่านั้น ส่วนบุคคลรายการต้องใช้2,000TRUEและดำเนินการล็อกคลังบัญชี รายการและดำเนินการเลิกทีมต้องใช้ 3,000 TRUE และดำเนินการล็อกคลังบัญชีด้วย '
		},
		personSignUp: {
            personSignUp_Info: 'ข้อมูลส่วนบุคคล',
            personSignUp_title: 'การลงทะเบียนส่วนบุคคล'
		},
		teamInfo: {
            teamInfo_Info: 'ข้อมูลทีม',
            teamList: 'รายชื่อทีม',
            createTeam: 'สร้างทีม'
		},
		fillInfo: {
            _title: 'กรอกข้อมูล',
            nickName: 'ชื่อเล่น',
            teamNickname: 'ชื่อเล่นของทีม',
            declaration: 'คำประกาศการเลือกตั้ง ',
            contactInformation: 'วิธีติดต่อ',
            reason: "เหตุผลในการสมัคร",
            _success: 'การส่งใบสมัครที่ประสบความสำเร็จ',
            _success_info: 'ส่งใบสมัครเรียบร้อยแล้วโปรดรอให้กัปตันจัดการ'
		},
		InsufficientQualification: {
            qu_1: 'โหนดมาตรฐานการลงทะเบียนส่วนบุคคลต้องมีจำนวนไม่น้อยกว่า2,000 TRUE',
            qu_2: "การลงทะเบียนส่วนบุคคลของโหนดทั้งหมดต้องมีค่าไม่น้อยกว่า50,000 TRUE",
            qu_3: 'สร้างทีมต้องมีจำนวนไม่น้อยกว่า 1TRUE'
		},
		application: {
            _success: 'การสมัครได้รับการอนุมัติแล้วโปรดดำเนินการในขั้นตอนต่อไป',
            _fail: 'การสมัครล้มเหลว กัปตันปฏิเสธคำขอของคุณ'
        },
        myTeam: 'กองทีมของฉัน',
        personnelManagement: 'การจัดการบุคลากร ',
        futureMember: 'การจัดการบุคลากรที่ยังไม่ได้เข้าร่วม'
	},
	public: {
        second: 'วินาที',
        next: 'ขั้นตอนต่อไป',
        back: 'กลับ',
        save: 'บันทึก',
        payDetail: 'รายละเอียดการชำระเงิน',
        enterPassword: 'ป้อนรหัส',
        transferOutPrompt: 'ฟังก์ชันอีออกไม่สามารถใช้งานได้ในช่วงเวลาการลงคะแนนโหนดลำดับความสำคัญ! ',
        LockedWarehouse: 'ล็อคคลัง',
        lockedWarehouseAddr: 'ที่อยู่ล็อคคลัง',
        transferIn: 'โอนเข้า',
        transferOut: 'โอนออก',
        verifyPwd: 'ยืนยันรหัสผ่าน ',
        inputPwd: 'ป้อนรหัสผ่านของคุณ',
        PwdIsNull: 'โปรดป้อนรหัสผ่าน',
        define: 'ตกลง',
        cancel: 'ยกเลิก',
        copySuccess: 'คัดลอกสำเร็จ ',
        copyfailed: 'คัดลอกล้มเหลว',
        wrongPwd: 'รหัสผ่านไม่ถูกต้องโปรดป้อนใหม่',
        transactionSuccess: ' ประกาศการทำธุรกรรมเรียบร้อยแล้ว ',
        transactionFailed: ' ประกาศการทำธุรกรรมล้มเหลวโปรดลองอีกครั้งในภายหลัง ',
        คะแนน: 'คะแนน',
        tickets: '票',
        signSuccess: 'ลงทะเบียนเรียบร้อยแล้ว',
        signSuccess_info: 'ขอแสดงความยินดีกับการลงทะเบียนสำเร็จ',
        joinTeam: 'เข้าร่วมทีม',
        enterMobile: 'กรุณาป้อนหมายเลขโทรศัพท์',
        enterCaptcha: 'ป้อนรหัสยืนยันที่ภาพ',
        enterMobileCode: 'ป้อนรหัสยืนยันที่โทรศัพท์',
        getMobileCode: 'รับรหัสยืนยัน',
        captchaError: 'รหัสยืนยันภาพไม่ถูกต้องโปรดยืนยันอีกครั้ง',
        hasBind: 'หมายเลขโทรศัพท์ถูกผูกไว้กับที่อยู่แล้ว',
        verificationCodeError: 'รหัสยืนยันโทรศัพท์ผิด',
        Enter_the_legal_mobile_number: 'โปรดป้อนหมายเลขโทรศัพท์ตามกฎหมาย',
        walletName: 'ชื่อกระเป๋าสตางค์',
        electoralManifesto: 'คำประกาศการเลือกตั้ง',
        nickName: 'ชื่อเล่น',
        personaNickName: 'ชื่อเล่นส่วนบุคคล',
        personalSign: 'ข้อมูลส่วนบุคคล ',
        scan: 'สแกน',
        refuse: 'ปฏิเสธ ',
        agree: 'ตกลง ',
        mnemonic:'คำช่วยจำง่ายคือรูปแบบการแสดงออกอีกอย่างหนึ่งของคีย์ส่วนตัวCleartext  เสนอครั้งแรกโดยข้อเสนอ BIP39 มีวัตถุประสงค์เพื่อช่วยผู้ใช้จดจำคีย์ส่วนตัวที่ซับซ้อน (64-bit hash)  คำช่วยจำง่ายโดยทั่วไปประกอบด้วย 12 15 18 และ 21 คำซึ่งทั้งหมดจะนำมาจากคำศัพท์คงที่  ลำดับของการสร้างขึ้นอยู่กับอัลกอริทึมบางอย่างดังนั้นผู้ใช้จึงไม่ต้องกังวลกับการป้อนคำ 12 คำก็สร้างที่อยู่ ได้  แม้ว่าทั้งสองคำช่วยจำง่ายและ Keystore สามารถใช้เป็นรูปแบบอีกอย่างหนึ่งของคีย์ส่วนตัวได้  แต่ที่ต่างกับ Keystoreคือคำช่วยจำง่ายเป็นคีย์ส่วนตัวที่ไม่มีการเข้ารหัสลับไม่มีการรักษาความปลอดภัยเลย ใครก็ตามที่ได้รับคำช่วยจำง่ายของคุณก็สามารถใช้ทรัพย์สินของคุณได้โดยใช้ความพยายามเพียงเล็กน้อย  ดังนั้นหลังจากที่ผู้ใช้สำรองคำช่วยจำง่าย  ต้องระวังความสนใจกับสามจุดดังนี้: 1. ใช้สื่อสำรองข้อมูลทางกายภาพให้มากที่สุดเท่าที่จะเป็นไปได้ เช่นใช้ปากกาเพื่อทำสำเนาบนกระดาษ ฯลฯ ให้มากที่สุดเท่าที่จะไม่ใช้หน้าจอหรือถ่ายรูปและนำไปวางบนอุปกรณ์เครือข่ายเพื่อป้องกันไม่ให้แฮกเกอร์ขโมย  2. ตรวจสอบว่าการสำรองข้อมูลมีความถูกต้องหลายครั้งเมื่อคุณพิมพ์ผิดคำหนึ่งหรือสองคำแล้วจะทำให้เกิดปัญหาในการเรียกคืนคำช่วยจำง่ายที่ถูกต้อง  3. เก็บตัวอย่างสํารองไว้ในที่ปลอดภัยและใช้มาตรการป้องกันการโจรกรรมและการป้องกันการสูญหาย ',
        mnemonic_ps: 'PS:ผู้ใช้สามารถใช้คำช่วยจำง่ายสร้างการสำรองข้อมูล นำเข้าห่วงโซ่กระเป๋าสตางค์ต้นใหม่ สร้าง keystore ใหม่ด้วยรหัสผ่านใหม่และแก้ไขรหัสผ่านกระเป๋าเงินด้วยวิธีนี้  ',
        keystore:'ไฟล์ Keystore เป็นรูปแบบไฟล์ (JSON) สำหรับจัดเก็บคีย์ส่วนตัวในกระเป๋า Ethereum  ใช้การเข้ารหัสด้วยรหัสผ่านที่ผู้ใช้ตั้งแองเพื่อให้การป้องกันระดับ แล้วระดับการป้องกันขึ้นอยู่กับความแรงของรหัสผ่านของผู้ใช้ตั้ง  หากรหัสผ่านเช่น 123456 ไม่ปลอดภัยอย่างมาก มีสองข้อที่ควรทราบเมื่อใช้ Keystore: 1. เข้ารหัสไฟล์ keystore ด้วยรหัสผ่านที่ไม่ใช้กันทั่วไปและซับซ้อนเท่าที่จะเป็นไปได้  2. อย่าลืมจดจำรหัสผ่านของKeystore ตอนลืมรหัสผ่านคุณจะสูญเสียสิทธิ์ในการใช้Keystore และกระเป๋าสตางค์เริ่มต้นจะไม่สามารถเรียกรหัสผ่านของคุณได้ ดังนั้นโปรดเก็บ Keystore และรหัสผ่านไว้ดี ดังต่อไปนี้เป็นรูปแบบการของ keystore: { "version": 3, "id": "b7467fcb-3c8b-41be-bccf-73d43a08c1b7", "address": "540f18196da5a533fa36577a81de55f0a2f4e751", "Crypto": { "ciphertext": "78ed11b8b6bf29b00f52b42b8542df0e4a6ac078e626af7edcf885c3b68154a4", "cipherparams": { "iv": "4516579601d96695fe30ace985a9066f" }, "cipher": "aes-128-ctr", "kdf": "scrypt", "kdfparams": { "dklen": 32, "salt": "6276cfda7d40872352c801db5871e5a3368a8d0994cea39ed936760db78d1cdc", "n": 1024, "r": 8, "p": 1 }, "mac": "d889a5dc609c3f312a41394cc47640676d2612501a6f8c837ed55598158336db" } }。',
        Keystore_ps: 'PS: รหัสผ่านสำหรับ Keystore จะไม่ซ้ำกันและไม่สามารถเปลี่ยนแปลงได้ หากคุณต้องการเปลี่ยนรหัสผ่านกระเป๋าเงินคุณจะต้องนำเข้ากระเป๋าสตางค์อีกครั้งด้วยmnemonicหรือคีย์ส่วนตัวCleartext  และเข้ารหัสด้วยรหัสผ่านใหม่เพื่อสร้าง keystore ใหม่ ',
        privateKey:'เรามักพูดกันว่าการควบคุมเงินในกระเป๋าสตางค์ของคุณขึ้นอยู่กับความเป็นเจ้าของและการควบคุมคีย์ส่วนตัว ในการทำธุรกรรมblockchain คีย์ส่วนตัวจะใช้ในการสร้างลายเซ็นที่จำเป็นในการจ่ายสกุลเงิน  เพื่อพิสูจน์ความเป็นเจ้าของกองทุน  เนื่องจากเมื่อมีการรั่วไหลไปยังบุคคลที่สาม สินทรัพย์ที่อยู่ภายใต้การคุ้มครองของคีย์ส่วนตัวจะถูกส่งมอบด้วยฟรี มันไม่เหมือนKeystore Keystoreเป็นไฟล์ส่วนตัวที่ตั้งมีรหัสไว้แล้ว  ความแข็งแรงของรหัสพอเพียงนั้นแม้ว่าแฮกเกอรำได้Keystoreอยากทำลายก็ไม่ง่าย ที่จริงแล้วคีย์ส่วนตัวไม่ได้เก็บอยู่บนเน็ต มันเกิดด้วยผู้ใช้สร้างแล้วเก็บอยู่ไฟล์อันหนึ่งหรือเก็บในฐานข้อมูลอย่างง่าย ๆ  ได้ชื่อว่ากระเป๋าสตางค์ คีย์ที่เก็บในกระเป๋าสตางค์อยู่ลำพัง สามารถเกิดจากซอฟต์แวร์กระเป๋าสตางค์แล้วบริการกันด้วย ไม่ต้องการเชื่อมต่อ blockchain หรือเครือข่าย ที่อยู่กระเป๋าสตางค์ของผู้ใช้ถูกสร้างโดยคีย์ส่วนตัวผ่านการเข้ารหัสเส้นโค้งรูปไข่เพื่อสร้างคีย์สาธารณะซึ่งจะสร้างที่อยู่ 42 บิตโดยเริ่มต้นด้วย 0x  รูปแบบคีย์ส่วนตัวคือสตริงแฮชของเลขฐานสิบหก 64 บิตตัว อย่างเช่น:56f759ece75f0ab1b783893cbe390288978d4d 4ff24dd233245b4285fcc31cf6。',
        privateKey_ps: 'PS: ผู้ใช้สามารถใช้คีย์ส่วนตัวCleartext ของคำช่วยจำง่ายนำเข้า TrueChain ใช้รหัสผ่านใหม่เพื่อสร้าง Keystore ใหม่ (อย่าลืมลบ Keystore เก่า) และใช้วิธีนี้เพื่อแก้ไขรหัสผ่านกระเป๋าเงิน'

	}
};